snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Табель/Табель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Табель</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСотрудников</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>EnumRef.СостояниеТабеля</types>
      </type>
    </attributes>
    <attributes>
      <name>Переработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентПереработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСмены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСмены</name>
      <type>
        <types>EnumRef.СостояниеТабеля</types>
      </type>
    </attributes>
    <attributes>
      <name>Вход</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выход</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработанноеВремя</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ошибки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроходыЗаДень</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроходыСКУД1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроходыСКУД2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереработкаСКУД</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаРедактирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФизическогоУзла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическийСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСклада</name>
    <type>
      <types>EnumRef.ВидСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогОбмена77</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШКПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогОбменаПеремещениями</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПроверятьНаличиеДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <comment>Приоритет для сортировки в отчетах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольКратности</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборПечатныхФорм</name>
    <type>
      <types>CatalogRef.НаборыПечатныхФорм</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПути</name>
    <comment>Склад для оприходования товара который не доехал, или еще не принят складом</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.ТипСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>НеНачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтгрузкиТранзитом</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортныйОтдел</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладБухгалтерии</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляРаспределенияЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапретаОтправкиНаСклад</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольГрафикаОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДляПеремещений</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НужноПаллетирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НужнаТермоусадка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладВозвратаСКомиссии</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>КарантинЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСкладFBS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСкладМаркированногоТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтрольКратностиНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольКратности</name>
      <type>
        <types>EnumRef.ТипыШтрихКодов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ШтрихКоды/ШтрихКоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихКоды</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШК</name>
    <type>
      <types>EnumRef.ВидыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаМодификации</name>
    <type>
      <types>EnumRef.ПричиныКорректировкиШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтВКоробе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматШК</name>
    <type>
      <types>EnumRef.ФорматыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКодGS1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/CommonModules/РаботаСWS/Module.bsl
Функция ПолучитьСтруктуруСправочниковДляWS (ТЗСправочников) Экспорт 
	
	СтруктураОбмена=Новый Структура();		
	Для каждого СтрТЗ из ТЗСправочников цикл
		если СтрТЗ.ИмяСправочника="Номенклатура"  тогда
			СтруктураМассивов=ПолучитьМассивНоменклатурыДляWS();
			СтруктураОбмена.Вставить("МассивТоваров",СтруктураМассивов["МассивВыгрузки"]);	
		ИначеЕсли  СтрТЗ.ИмяСправочника="ШтрихКоды"  тогда
			Если СтруктураМассивов<>Неопределено тогда
				ТЗ=СтруктураМассивов["ТаблицаНоменклатуры"];
			иначе
				ТЗ=Неопределено
			КонецЕсли;
			СтруктураОбмена.Вставить("МассивШтрихКодов",ПолучитьМассивШКДляWS(ТЗ));	
		КонецЕсли;
	КонецЦикла;
	Возврат СтруктураОбмена	
КонецФункции


Функция ПолучитьМассивНоменклатурыДляWS ()
	МассивВыгрузки=новый Массив;	
	
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 30
	|	ОстаткиТМЦОстатки.Номенклатура.Наименование КАК Наименование,
	|	ОстаткиТМЦОстатки.Номенклатура.Цвет.Наименование КАК Цвет,
	|	ОстаткиТМЦОстатки.Номенклатура.Размер.Наименование КАК Размер,
	|	ОстаткиТМЦОстатки.Номенклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке,
	|	ОстаткиТМЦОстатки.Номенклатура.Родитель.ШтукВКоробочке КАК ШтукВКоробочке,
	|	ОстаткиТМЦОстатки.Номенклатура КАК НоменклатураСсылка,
	|	ОстаткиТМЦОстатки.Номенклатура.Код КАК Код
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2, Склад = &Склад) КАК ОстаткиТМЦОстатки
	|ГДЕ
	|	ОстаткиТМЦОстатки.КоличествоОстаток > 0";
	запрос.УстановитьПараметр("Дата2",КонецДня(ТекущаяДата()));
	запрос.УстановитьПараметр("Склад",Справочники.Склады.НайтиПоКоду("STA-48"));	
	ТЗ=запрос.Выполнить().выгрузить();
	Для каждого результат из ТЗ цикл
		если результат.Наименование=Null тогда Продолжить;КонецЕсли;
		ВремСтруктура = новый Структура("Наименование,Код,Цвет,Размер,ШтукВКоробке,ШтукВКоробочке",
		результат.Наименование,
		результат.Код,		
		результат.Цвет,
		результат.Размер,
		результат.ШтукВКоробке,
		результат.ШтукВКоробочке);			
		МассивВыгрузки.Добавить(ВремСтруктура);			
	КонецЦикла;
	СтруктураВозврата=новый Структура;
	СтруктураВозврата.Вставить("МассивВыгрузки",МассивВыгрузки);
	СтруктураВозврата.Вставить("ТаблицаНоменклатуры",тз.ВыгрузитьКолонку("НоменклатураСсылка"));
	
	Возврат СтруктураВозврата;
КонецФункции


Функция ПолучитьМассивШКДляWS  (МассивНоменклатуры)
	МассивВыгрузки=новый Массив;		
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ШтрихКоды.Наименование КАК Наименование,
	|	ШтрихКоды.ТипШК КАК ТипШК,
	|	ШтрихКоды.ВидШК КАК ВидШК,
	|	ШтрихКоды.Владелец.Код КАК КодНоменклатуры,
	|	ШтрихКоды.Код КАК Код
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	Не ШтрихКоды.ПометкаУдаления 
	|	И ПОДСТРОКА(ШтрихКоды.Наименование, 1, 4) <> ""9999""
	|	И ШтрихКоды.Владелец В(&Владелец)
	|	И ШтрихКоды.ТипШК <> &ТипШК
	|	И ШтрихКоды.ВидШК <> &ВидШК";
	если МассивНоменклатуры<>Неопределено тогда
		запрос.УстановитьПараметр("Владелец",МассивНоменклатуры);      //ШК по ряду позиций
	иначе
		запрос.Текст=СтрЗаменить(запрос.Текст,"И ШтрихКоды.Владелец В(&Владелец)","");    //Все ШК
	КонецЕсли;
	
	
	запрос.УстановитьПараметр("ВидШК",Перечисления.ВидыШК.ПустаяСсылка());
	запрос.УстановитьПараметр("ТипШК",Перечисления.ТипыШтрихКодов.ПустаяСсылка());	
	ТЗ=запрос.Выполнить().выгрузить();
	Для каждого результат из ТЗ цикл			
		если результат.Наименование=Null  тогда Продолжить;КонецЕсли;
		ТипШК=Перечисления.ТипыШтрихКодов.Индекс(результат.ТипШК);
		ВидШК=Перечисления.ВидыШК.Индекс(результат.ВидШК);
		
		ВремСтруктура = новый Структура("Наименование,ТипШК,ВидШК,КодНоменклатуры,Код",
		результат.Наименование,
		ТипШК,		
		ВидШК,
		результат.КодНоменклатуры,
		результат.Код);	
		
		МассивВыгрузки.Добавить(ВремСтруктура);			
	КонецЦикла;
	Возврат МассивВыгрузки;
КонецФункции




Функция ПолучитьСтруктуруПлановНабора () Экспорт 
	
	СтруктураОбмена=Новый Структура();		
	МассивВыгрузки=новый Массив;	
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПеремещениеТовары.Ссылка.Номер КАК Номер,
	|	ПеремещениеТовары.Ссылка.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ПеремещениеТовары.Номенклатура.код КАК Номенклатура,
	|	ПеремещениеТовары.Количество КАК Заявка
	|ИЗ
	|	Документ.Перемещение.Товары КАК ПеремещениеТовары
	|ГДЕ
	|	ПеремещениеТовары.Ссылка.Номер = &Номер
	|	И ПеремещениеТовары.Ссылка.Дата >= &Дата";
	запрос.УстановитьПараметр("Номер","SSP-015587");
	запрос.УстановитьПараметр("Дата",'20190711');
	ТЗ=запрос.Выполнить().выгрузить();
	Для каждого результат из ТЗ цикл
		ВремСтруктура = новый Структура("Номер,ДатаОтгрузки,Номенклатура,Заявка",
		результат.Номер,
		Строка(результат.ДатаОтгрузки),		
		результат.Номенклатура,
		результат.Заявка);
		МассивВыгрузки.Добавить(ВремСтруктура);			
	КонецЦикла;
	
	СтруктураОбмена.Вставить("МассивТоваров",МассивВыгрузки);	
	Возврат СтруктураОбмена;	
	
	
КонецФункции


// Кухарь А.Ю.  28.07.2022 начало
//
Функция ПолучитьДанныеТабеля(КодПодразделения,Дата) Экспорт
	СтруктураОбмена=Новый Структура();		
	МассивВыгрузки=новый Массив;	
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ТабельДанные.Сотрудник.ТабельныйНомер КАК СотрудникТабельныйНомер,
	|	ТабельДанные.Значение КАК Значение,
	|	ТабельДанные.Дата КАК Дата
	|ИЗ
	|	Документ.Табель.Данные КАК ТабельДанные
	|ГДЕ
	|	ТабельДанные.Ссылка.Подразделение = &Подразделение
	|	И ТабельДанные.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2";
	
	запрос.УстановитьПараметр("Подразделение",Справочники.Подразделения.НайтиПоКоду(КодПодразделения));
	запрос.УстановитьПараметр("Дата1",НачалоМесяца(Дата));
	запрос.УстановитьПараметр("Дата2",КонецМесяца(Дата));
	
	ТЗ=запрос.Выполнить().выгрузить();
	Для каждого результат из ТЗ цикл
		ВремСтруктура = новый Структура("СотрудникТабельныйНомер,Значение,Дата",
		результат.СотрудникТабельныйНомер,
		Строка(результат.Значение),		
		Строка(результат.Дата));
		МассивВыгрузки.Добавить(ВремСтруктура);			
	КонецЦикла;
	
	СтруктураОбмена.Вставить("МассивТоваров",МассивВыгрузки);	
	Возврат СтруктураОбмена;	
	

КонецФункции
// Кухарь А.Ю.  28.07.2022 конец



// Кухарь А.Ю.  06.07.2023 начало
//
Функция ПолучитьДанныеПоПапкамВерхнегоУровня () Экспорт
	СтруктураОбмена=Новый Структура();		
	МассивВыгрузки=новый Массив;	
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	             |	Номенклатура.Ссылка КАК Ссылка,
	             |	Номенклатура.Наименование КАК Наименование,
	             |	Номенклатура.Код КАК Код,
	             |	Номенклатура.ПометкаУдаления КАК ПометкаУдаления
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.ЭтоГруппа
	             |	И Номенклатура.Родитель = &Пустая
	             |	И Номенклатура.ВидНоменклатуры = &Товар";
	запрос.УстановитьПараметр("Товар",Перечисления.ВидыНоменклаутры.Товар);
	запрос.УстановитьПараметр("Пустая",Справочники.Номенклатура.ПустаяСсылка());
	
	ТЗ=запрос.Выполнить().выгрузить();
	Для каждого результат из ТЗ цикл
		ВремСтруктура = новый Структура("Наименование,Код,ПометкаУдаления,УИД",
		результат.Наименование,
		результат.Код,		
		результат.ПометкаУдаления,
		Строка(результат.ссылка.УникальныйИдентификатор()));
		МассивВыгрузки.Добавить(ВремСтруктура);			
	КонецЦикла;
	
	СтруктураОбмена.Вставить("МассивТоваров",МассивВыгрузки);	
	Возврат СтруктураОбмена;	
	
	
КонецФункции


Функция ПолучитьДанныеПоКаналамСбыта () Экспорт
	СтруктураОбмена=Новый Структура();		
	МассивВыгрузки=новый Массив;	
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	КаналСбыта.Ссылка КАК Ссылка,
	|	КаналСбыта.Код КАК Код,
	|	КаналСбыта.Наименование КАК Наименование
	|ИЗ
	|	Справочник.КаналСбыта КАК КаналСбыта
	|ГДЕ
	|	НЕ КаналСбыта.ЭтоГруппа
	|	И не КаналСбыта.ПометкаУдаления";
	
	ТЗ=запрос.Выполнить().выгрузить();
	Для каждого результат из ТЗ цикл
		ВремСтруктура = новый Структура("Наименование,Код,УИД",
		результат.Наименование,
		результат.Код,		
		Строка(результат.ссылка.УникальныйИдентификатор()));
		МассивВыгрузки.Добавить(ВремСтруктура);			
	КонецЦикла;
	
	СтруктураОбмена.Вставить("МассивТоваров",МассивВыгрузки);	
	Возврат СтруктураОбмена;	
	
	
КонецФункции


// Кухарь А.Ю.  06.07.2023 конец
